Repository: VCheckOrg/vcheck_ios
Catalog: Demo/Demo/*.lproj/Localizable.strings
Languages: pl, ru, uk

source: Confirm
pl: Potwierdzać
ru: Подтвердить
uk: Підтвердити

source: Cancel
pl: Anulować
ru: Отмена
uk: Скасувати

# demo_app_title
source: Sample VCheck SDK Partner app
pl: Przykładowa aplikacja partnerska VCheck SDK
ru: Пример партнерского приложения VCheck SDK
uk: Зразок партнерської програми VCheck SDK

source: Become a partner
pl: Stać się partnerem
ru: Стать партнером
uk: Стати партнером

# repeat_demo
source: Try again
pl: Spróbuj ponownie
ru: Попробуйте еще раз
uk: Спробуйте знову

# verification_in_process_title
source: You application is processing
pl: Twój wniosek jest przetwarzany
ru: Ваша заявка обрабатывается
uk: Ваша заявка обробляється

# verification_in_process_subtitle
source: This may take some time. Please, keep the app in foreground mode.
pl: Może to zająć trochę czasu. Nie zamykaj ani nie umieszczaj aplikacji w tle.
ru: Это может занять некоторое время. Пожалуйста, не закрывайте и не переводите приложение в фоновый режим.
uk: Це може тривати деякий час. Будь ласка, не закривайте та не переводьте програму у фоновий режим.

# verification_success_title
source: Verification successful
pl: Weryfikacja powiodła się
ru: Проверка прошла успешно
uk: Перевірка успішна

# verification_success_descr
source: You have been verified. Thank you for using our demos. You can retry flow by pressing button below.
pl: Zostałeś zweryfikowany. Dziękujemy za skorzystanie z naszych wersji demonstracyjnych. Możesz spróbować ponownie, naciskając przycisk poniżej.
ru: Вы прошли верификацию. Благодарим вас за использование наших демо-версий. Вы можете повторить операцию, нажав кнопку ниже.
uk: Ви пройшли верифікацію. Дякуємо вам за використання наших демо-версій. Ви можете повторити операцію, натиснувши кнопку нижче.

# verification_failed_title
source: Verification failed
pl: Weryfikacja nie powiodła się
ru: Проверка не удалась
uk: Не вдалося перевірити

# verification_failed_descr
source: Unfortunately, your verification was not successful. You can try again by pressing the button below.
pl: Niestety weryfikacja nie powiodła się. Możesz spróbować ponownie, naciskając poniższy przycisk.
ru: К сожалению, ваша проверка не прошла успешно. Вы можете попробовать еще раз, нажав кнопку ниже.
uk: На жаль, ваша перевірка не пройшла успішно. Ви можете спробувати ще раз, натиснувши кнопку нижче.

source: Full Verification
pl: Pełna weryfikacja
ru: Полная проверка
uk: Повна перевірка

source: Verification Of Documents
pl: Weryfikacja dokumentów
ru: Проверка документов
uk: Перевірка документів

source: Verification Of Liveness
pl: Weryfikacja na żywo
ru: Проверка на живость
uk: Перевірка на живість

source: Choose custom SDK UI colors (optional):
pl: Wybierz kolory interfejsu użytkownika SDK (opcjonalnie):
ru: Выберите пользовательские цвета пользовательского интерфейса SDK (необязательно):
uk: Виберіть користувацькі кольори інтерфейсу SDK (необов’язково):

source: - Background primary color
pl: - Podstawowy kolor tła
ru: - Основной цвет фона
uk: - Основний колір фону

# background_color_for_main_cards_n_and_sections
source: - Background color for main cards and sections
pl: - Kolor tła kart głównych i sekcji
ru: - Цвет фона для основных карточек и разделов
uk: - Колір фону для основних карток і розділів

# background_color_for_complex_n_buttons_and_smaller_cards
source: - Background color for complex buttons and smaller cards
pl: - Kolor tła dla kompleksowych przycisków i mniejszych kart
ru: - Цвет фона для сложных кнопок и карточек меньшего размера
uk: - Колір фону для складних кнопок і менших карток

source: - Primary text color
pl: - Podstawowy kolor tekstu
ru: - Основной цвет текста
uk: - Основний колір тексту

source: - Secondary text color
pl: - Dodatkowy kolor tekstu
ru: - Дополнительный цвет текста
uk: - Вторинний колір тексту

source: - Common action buttons color
pl: - Wspólny kolor przycisków akcji
ru: - Цвет основных кнопок
uk: - Колір основних кнопок

source: - Borders color
pl: - Kolor ramek
ru: - Цвет границ
uk: - Колір границь

source: - Icons color
pl: - Kolor ikon
ru: - Цвет иконок
uk: - Колір іконок

source: Reset colors
pl: Resetowanie kolorów
ru: Сбросить цвета
uk: Скинути кольори

# buttons_text_color
source: Common buttons text color
pl: Wspólny kolor tekstu przycisków
ru: Цвет текста основных кнопок
uk: Колір тексту основних кнопок

# partner_inv_title
source: Become a VCHECK partner
pl: Zostań partnerem VCHECK
ru: Стать партнером VCHECK
uk: Станьте партнером VCHECK

# partner_inv_form_descr
source: Fill out the form and our specialist will contact you soon
pl: Wypełnij formularz, a nasz specjalista wkrótce się z Tobą skontaktuje
ru: Заполните форму и наш специалист свяжется с вами в ближайшее время
uk: Заповніть форму і наш спеціаліст зв'яжеться з вами найближчим часом

# partner_inv_company
source: Company
pl: Firma
ru: Компания
uk: Компанія

# partner_inv_name
source: Name
pl: Imię
ru: Имя
uk: Ім'я

# partner_inv_phone
source: Phone
pl: Telefon
ru: Номер телефона
uk: Номер телефону

# partner_inv_agree
source: I agree to the processing of personal data
pl: Wyrażam zgodę na przetwarzanie danych osobowych
ru: Я согласен на обработку персональных данных
uk: Даю згоду на обробку персональних даних

# send
source: Become a partner
pl: Zostać partnerem
ru: Стать партнером
uk: Стати партнером

# partner_form_successfully_sent
source: The form has been submitted successfully. We will contact you shortly. Thank you for your interest in our product!
pl: Formularz został przesłany pomyślnie. Wkrótce się z Tobą skontaktujemy. Dziękujemy za zainteresowanie naszym produktem!
ru: Форма успешно отправлена. Мы свяжемся с Вами в скором времени. Благодарим Вас за интерес к нашему продукту!
uk: Форму успішно надіслано. Ми зв'яжемося з вами найближчим часом. Дякуємо за інтерес до нашого продукту!

# partner_form_request_error
source: Error: form was not successfully submitted
pl: Błąd: formularz nie został pomyślnie przesłany
ru: Ошибка: форма не была успешно отправлена
uk: Помилка: форму не було успішно надіслано

# et_enter_valid_email
source: Please enter valid email
pl: Wprowadź prawidłowy adres e-mail
ru: Пожалуйста, введите действительный адрес электронной почты
uk: Введіть дійсну адресу електронної пошти

# et_enter_valid_name
source: Please enter valid name
pl: Wprowadź prawidłowe imię
ru: Пожалуйста, введите действительное имя
uk: Введіть дійсне ім'я

# et_enter_valid_company
source: Please enter valid company name
pl: Wprowadź prawidłową nazwę firmy
ru: Пожалуйста, введите действительное название компании
uk: Введіть дійсну назву компанії

# et_enter_valid_phone
source: Please enter valid phone
pl: Wprowadź prawidłowy numer telefonu
ru: Пожалуйста, введите действительный номер телефона
uk: Введіть дійсний номер телефону

# agreement_not_checked
source: To continue you have to agree to data processing
pl: Aby kontynuować, musisz wyrazić zgodę na przetwarzanie danych
ru: Для продолжения вам необходимо согласиться на обработку данных
uk: Щоб продовжити, ви повинні погодитися на обробку даних

# pop_sdk_title
source: To verification start
pl: Do rozpoczęcia weryfikacji
ru: К началу верификации
uk: До старту верифікації

# upload_design_config_descr
source: You can paste json text data from clipboard with the theme config generated by our service to customize UI/UX looks
pl: Możesz wkleić dane tekstowe json ze schowka z konfiguracją motywu wygenerowaną przez naszą usługę, aby dostosować wygląd UI / UX
ru: Вы можете вставить текстовые данные JSON из буфера обмена с конфигурацией темы, созданной нашим сервисом, чтобы настроить вид UI/UX
uk: Ви можете вставити текстові дані json із буфера обміну за допомогою конфігурації теми, створеної нашою службою, щоб налаштувати зовнішній вигляд UI/UX

# upload_design_config_file
source: Paste
pl: Wklej
ru: Вставить
uk: Вставити

source: Partner ID
pl: ID partnera
ru: ID партнера
uk: ID партнера

source: Partner Secret
pl: Sekret partnera
ru: Секрет партнера
uk: Секрет партнера

source: Design Config (optional)
pl: Konfiguracja projektu (opcjonalnie)
ru: Дизайн-конфигурация (опционально)
uk: Дизайн-конфігурація (опціонально)

source: Choose Scheme
pl: Wybierz schemat
ru: Выбрать схему
uk: Вибрати схему

# err_invalid_partner_id
source: Invalid partner ID
pl: Nieprawidłowy identyfikator partnera
ru: Некорректный ID партнера
uk: Некоректний ID партнера

# err_invalid_partner_secret
source: Invalid partner secret
pl: Nieprawidłowy sekret partnera
ru: Некорректный секрет партнера
uk: Некоректний секрет партнера

# err_clipboard_has_no_data
source: Clipboard has no data!
pl: Schowek nie zawiera danych!
ru: В буфере обмена нет данных!
uk: Буфер обміну не має даних!

# clipboard_pasted
source: Clipboard data pasted
pl: Wklejono dane ze schowka
ru: Данные из буфера обмена вставлены
uk: Дані буфера обміну вставлено

# err_verif_expired
source: Verification expired. Try again
pl: Weryfikacja wygasła. Spróbuj ponownie
ru: Срок верификации истек. Попробуйте еще раз
uk: Термін дії верифікації минув. Повторіть спробу
